# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [22]:
# Your code here; import the necessary packages
import pandas as pd
import sqlite3

In [23]:
# Your code here; create the connection
conn = sqlite3.connect('data/data2.sqlite')

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [24]:
# Your code here
q0 = '''
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
WHERE customerNumber IN (
    SELECT customerNumber
    FROM orders
    WHERE orderDate = '2003-01-31'
    )
;
'''

pd.read_sql(q0, conn)

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [25]:
# Your code here
q1 = '''
SELECT
    productName,
    COUNT(orderNumber) AS numberOfOrders,
    SUM(quantityOrdered) AS totalUnitsSold
FROM products
JOIN orderdetails
    USING (productCode)
GROUP BY productName
ORDER BY totalUnitsSold DESC
    
;
'''

pd.read_sql(q1, conn)

                                 productName  numberOfOrders  totalUnitsSold
0                1992 Ferrari 360 Spider red              53            1808
1                       1937 Lincoln Berline              28            1111
2                  American Airlines: MD-11S              28            1085
3    1941 Chevrolet Special Deluxe Cabriolet              28            1076
4               1930 Buick Marquette Phaeton              28            1074
..                                       ...             ...             ...
104             1999 Indy 500 Monte Carlo SS              25             855
105                       1911 Ford Town Car              25             832
106         1936 Mercedes Benz 500k Roadster              25             824
107               1970 Chevy Chevelle SS 454              25             803
108                    1957 Ford Thunderbird              24             767

[109 rows x 3 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [28]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT

q2 = '''
SELECT productName, COUNT(DISTINCT customerNumber) AS numPurchasers
FROM products
JOIN orderdetails
    USING(productCode)
JOIN orders
    USING(orderNumber)
GROUP BY productName
ORDER BY numPurchasers DESC
;
'''

pd.read_sql(q2, conn)

                             productName  numPurchasers
0            1992 Ferrari 360 Spider red             40
1                       Boeing X-32A JSF             27
2                    1972 Alfa Romeo GTA             27
3               1952 Alpine Renault 1300             27
4                     1934 Ford V8 Coupe             27
..                                   ...            ...
104  1958 Chevy Corvette Limited Edition             19
105                  2002 Chevy Corvette             18
106            1969 Chevrolet Camaro Z28             18
107                    1952 Citroen-15CV             18
108                   1949 Jaguar XK 120             18

[109 rows x 2 columns]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [29]:
# Your code here

q3 = '''
SELECT
    e.employeeNumber,
    e.firstName,
    e.lastName,
    o.officeCode,
    o.city
FROM
    offices o,
    employees e,

'''
pd.read_sql(q3, conn)
#argh come back to this later!!!

DatabaseError: Execution failed on sql '
SELECT
    employeeNumber,
    firstName,
    lastName,
    officeCode,
    o.city


': no such column: employeeNumber

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [ ]:
# Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!